Revit 2027 API
ParameterTypeId.StructuralSectionPolygonDefinition Property
 "Polygon definition"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionPolygonDefinition { get; }
Public Shared ReadOnly Property StructuralSectionPolygonDefinition As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionPolygonDefinition {
	ForgeTypeId^ get ();
}
static member StructuralSectionPolygonDefinition : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace